In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)

df.head()

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [14]:
df.describe()

        max_speed
count    4.000000
mean   137.800000
std    169.053916
min     24.000000
25%     49.500000
50%     69.100000
75%    157.400000
max    389.000000

Some References:
* https://datascientyst.com/use-groupby-multiple-columns-pandas/ Multi index
* https://pandas.pydata.org/docs/user_guide/advanced.html# MultiIndex / advanced indexing
* https://stackoverflow.com/questions/36510146/how-to-get-value-by-multi-index-with-python-pandas
* https://stackoverflow.com/questions/18835077/selecting-from-multi-index-pandas selecting from multi-index pandas
* https://pandas.pydata.org/docs/reference/api/pandas.MultiIndex.get_level_values.html
*

In [15]:
(389+24+80+58)/4

137.75

In [9]:
dfgc = df.groupby("class")
dfgc

In [32]:
dfgc = df.groupby("class").sum()
dfgc

        max_speed
class
bird        413.0
mammal      138.2

In [51]:
dfgc = df.groupby("class").count()
print(type(dfgc))
print(dfgc.columns)
dfgc

<class 'pandas.core.frame.DataFrame'>
Index(['order', 'max_speed'], dtype='object')

        order  max_speed
class
bird        2          2
mammal      3          2

In [52]:
dfgc['max_speed']['bird']

2

In [53]:
#.to_frame().rename(columns={'Zip':'Violations'}).reset_index()
dfgc = dfgc.reset_index()
dfgc

    class  order  max_speed
0    bird      2          2
1  mammal      3          2

In [54]:
dfgc['max_speed'][0]

2

In [55]:
dfgc['max_speed'][dfgc['class']=='bird']

0    2
Name: max_speed, dtype: int64

In [12]:
dfgco = df.groupby(["class","order"])
dfgco

In [23]:
dfgcoSum = dfgco.sum()
print(type(dfgcoSum))
dfgcoSum

<class 'pandas.core.frame.DataFrame'>

                       max_speed
class  order
bird   Falconiformes       389.0
       Psittaciformes       24.0
mammal Carnivora           138.2
       Primates              0.0

In [31]:
dfgcoSum['max_speed']['bird']['Falconiformes']

389.0

In [58]:
dfgcoSum = dfgcoSum.reset_index()
dfgcoSum

    class           order  max_speed
0    bird   Falconiformes      389.0
1    bird  Psittaciformes       24.0
2  mammal       Carnivora      138.2
3  mammal        Primates        0.0

In [61]:
#dfZipGp3['ViolationsPerCapita']  = dfZipGp3['Violations'] / dfZipGp3['Zip'].map(dfpop2.set_index(['Zip Code'])['Population'])
dfgcoSum['ratio1'] = dfgcoSum['max_speed']/dfgcoSum['class'].map(dfgc.set_index(['class'])['max_speed'])
dfgcoSum

    class           order  max_speed  ratio1
0    bird   Falconiformes      389.0   194.5
1    bird  Psittaciformes       24.0    12.0
2  mammal       Carnivora      138.2    69.1
3  mammal        Primates        0.0     0.0

In [27]:
dfgco.size()

class   order
bird    Falconiformes     1
        Psittaciformes    1
mammal  Carnivora         2
        Primates          1
dtype: int64

In [28]:
dfgco.count()

                       max_speed
class  order
bird   Falconiformes           1
       Psittaciformes          1
mammal Carnivora               2
       Primates                0

In [16]:
df.describe()

        max_speed
count    4.000000
mean   137.800000
std    169.053916
min     24.000000
25%     49.500000
50%     69.100000
75%    157.400000
max    389.000000

In [17]:
df.mean()

/var/folders/bs/v93xlq0d24n2x1clkyc1lk840000gp/T/ipykernel_46859/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

max_speed    137.8
dtype: float64

In [19]:
#df.describe()['mean'] #error

In [20]:
df.sum()

class                               birdbirdmammalmammalmammal
order        FalconiformesPsittaciformesCarnivoraPrimatesCa...
max_speed                                                551.2
dtype: object

In [24]:
#dfgco.sum().to_frame() #AttributeError: 'DataFrame' object has no attribute 'to_frame' (kp: sum() returns a df)

In [26]:
#dfgco.count().to_frame() #AttributeError: 'DataFrame' object has no attribute 'to_frame'

In [62]:
import datetime
date = '2021-05-21 11:22:03'
datem = datetime.datetime.strptime(date, "%Y-%m-%d %H:%M:%S")
print(datem.day)        # 25
print(datem.month)      # 5
print(datem.year)       # 2021
print(datem.hour)       # 11
print(datem.minute)     # 22
print(datem.second)     # 3

21
5
2021
11
22
3

In [63]:
datetime.datetime.strptime('2016-06-03 00:00:00',"%Y-%m-%d %H:%M:%S").month

6

### Dynamically adding rows to a dataframe
Ref:
* https://www.pythonprogramming.in/how-dynamically-add-rows-to-dataframe.html Uses df.loc
* https://stackoverflow.com/questions/48030350/dynamically-add-rows-to-dataframe Uses df.at (Much faster)
* https://stackoverflow.com/questions/62643108/how-to-add-record-in-pandas-dataframe-dynamically-in-python Using a dictionary or a list for the whole row.

In [11]:
# https://www.pythonprogramming.in/how-dynamically-add-rows-to-dataframe.html
import pandas as pd
 
df = pd.DataFrame(columns=['Name', 'Age'])
 
df.loc[1, 'Name'] = 'Rocky'
df.loc[1, 'Age'] = 23
 
df.loc[2, 'Name'] = 'Sunny'
 
print(df)

    Name  Age
1  Rocky   23
2  Sunny  NaN

In [12]:
import pandas as pd
 
dfAt = pd.DataFrame(columns=['Name', 'Age'])
 
dfAt.at[1, 'Name'] = 'Rocky'
dfAt.at[1, 'Age'] = 23
 
dfAt.at[2, 'Name'] = 'Sunny'
 
print(dfAt)

    Name  Age
1  Rocky   23
2  Sunny  NaN

In [13]:
# https://stackoverflow.com/questions/48030350/dynamically-add-rows-to-dataframe

# @NickBraunagel's solution
%timeit df.loc[3, 'Name'] = 'KrishnaPrasadAdhikari'
display(df.head())

#
%timeit dfAt.at[3, 'Name'] = 'KrishnaPrasadAdhikari'
dfAt.head()

63.2 µs ± 2.36 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

                    Name  Age
1                  Rocky   23
2                  Sunny  NaN
3  KrishnaPrasadAdhikari  NaN

7.41 µs ± 259 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

                    Name  Age
1                  Rocky   23
2                  Sunny  NaN
3  KrishnaPrasadAdhikari  NaN

In [18]:
# https://stackoverflow.com/questions/62643108/how-to-add-record-in-pandas-dataframe-dynamically-in-python
import pandas as pd

# Adding rows with a dictionary
df = pd.DataFrame(columns=['Name', 'Age'])
new_row = {'Name': "KP", 'Age': 23}
df = df.append(new_row, ignore_index = True)
df = df.append({'Name': "GP", 'Age': 55}, ignore_index = True)
df.head()

  Name Age
0   KP  23
1   GP  55

In [17]:
import pandas as pd

# Adding rows with a list
df = pd.DataFrame(columns=['Name', 'Age'])
df.loc[len(df)] = ["KP", 23]
df.loc[len(df)] = ["BP", 30]
df.head()

  Name Age
0   KP  23
1   BP  30